Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_and_work/back_to_work_allow.html.txt.tmx
Source language: en
Languages: ga

source: Back to Work Allowance
ga: Liúntas um Fhilleadh ar Obair

source: The Back to Work Allowance Scheme encourages unemployed people (among others) to take up employment
ga: Spreagann an Scéim um Fhilleadh ar Obair do dhaoine dífhostaithe (i measc daoine eile) fostaíocht a fháil

source: The Scheme is aimed at people getting a social welfare payment for a certain period of time
ga: Tá an scéim dírithe ar dhaoine a fhaigheann íocaíocht leasa shóisialaigh do thréimhse ama ar leith

source: The Back to Work Allowance scheme is closed to new applicants from 1 May 2009
ga: Tá an Scéim um Fhilleadh ar Obair dúnta d'iarratasóirí nua ó 1 Bealtaine 2009

source: People participating in this scheme keep a percentage of their social welfare payment along with secondary benefits for a period of up to 3 years
ga: Coinníonn daoine atá rannpháirteach sa Scéim céatadán dá n-íocaíocht leasa shóisialaigh chomh maith le "sochair thánaisteacha" do thréimhse suas le 3 bliana

source: The percentage of your payment you keep is called the Back to Work Allowance
ga: Tugtar an Liúntas um Fhilleadh ar Obair ar an gcéatadán den íocaíocht a choinníonn tú

source: The Back to Work Allowance part of your income is not subject to taxation or social insurance (PRSI)
ga: Níl an chuid ded’ ioncam a fhaigheann tú ón Liúntas um Fhilleadh ar Obair faoi réir cánach nó árachais shóisialta (ÁSPC)

source: Your employer may also qualify for the Employers PRSI Exemption Scheme (closed from 1 May 2009)
ga: D’fhéadfadh d’fhostóir a bheith incháilithe don Scéim Díolúine ÁSPC freisin

source: Conditions you must meet
ga: Coinníollacha atá le sásamh agat:

source: To qualify for the Back to Work Allowance, you must:
ga: Beidh tú incháilithe don Liúntas um Fhilleadh ar Obair má tá tú:

source: • Be age 23 or over
ga: • A bheith 23 bliana d'aois nó níos mó

source: • Have been unemployed for 2 years
ga: • A bheith dífhostaithe ar feadh 2 bhliana

source: • Have an entitlement to Jobseeker's Allowance
ga: • teidlíocht a bheith agat do Liúntas Cuardaitheora Poist

source: You may also qualify, no matter what age you are, if you are getting one of the following payments for 15 months (or 12 months if you are aged 50 or over):
ga: D’fhéadfá a bheith incháilithe chomh maith, is cuma cén aois atá agat, má fhaigheann tú ceann de na híocaíochtaí a leanas ar feadh 15 mhí (nó 12 mhí má tá tú 50 bliana d’aois nó níos sine):

source: • You have been getting Farm Assist, Pre-Retirement Allowance, One-Parent Family Payment, Blind Pension, Disability Allowance, Carer's Allowance (if you are no longer a carer), Invalidity Pension, Deserted Wife's Benefit or Allowance, Prisoner's Wife's Allowance, Incapacity Supplement, Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension or Prisoner's Wife's Allowance
ga: • Cúnamh Feirme, Liúntas Réamhscoir, Íocaíocht Teaghlaigh Aontuismitheora, Pinsean na nDall, Liúntas Míchumais, Liúntas Cúramóra (murar cúramóir atá ionat a thuilleadh), Pinsean Easláinte, Sochar nó Liúntas Banchéile Thréigthe, Forlíonadh Éagumais, Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach) nó Liúntas Banchéile Príosúnaigh

source: You don't have to be any specific age to qualify in these cases
ga: Ní gá duit aois ar leith a bheith agat chun cáiliú sna cásanna seo

source: • You have been getting Illness Benefit for at least 3 years
ga: • Sochar Breoiteachta á fháil agat le 3 bliana anuas ar a laghad

source: Time spent on FÁS, Failte Ireland, Teagasc, FIT, Community Employment, Job Initiative, 'second chance education courses' (i.e., Back to Education Schemes) and/or time spent in prison are accepted as periods of unemployment
ga: Tá tréimhse caite ar chúrsaí FÁS, Fáilte Ireland, Teagasc, Modh Mear don Teicneolaíocht Faisnéise, Tionscnamh Jabanna, ‘cúrsaí oideachais athdheise’ (.i.. Scéimeanna um Fhilleadh ar Oideachas) agus/nó tréimhse caite i bpríosún inghlactha mar thréimhsí dífhostaíochta

source: Also, time spent on Supplementary Welfare Allowance or in Direct Provision can count towards the qualifying period for Back to Work Allowance provided you are entitled to a qualifying payment before starting on the scheme
ga: Lena chois sin, is féidir le tréimhse caite ar Liúntas Leasa Forlíontach nó i bhForáil Dhíreach comhaireamh i dtreo thréimhse incháilithe don Liúntas um Fhilleadh ar an Obair chomh fada agus go bhfuil tú incháilithe d’íocaíocht incháilithe roimh thús na scéime

source: Conditions your prospective employer must meet
ga: Coinníollacha atá le sásamh ag fostóir ionchasach:

source: Only employers who can provide suitable jobs are eligible to participate. The work being offered must:
ga: Fostóirí amháin gur féidir leo poist oiriúnacha a sholáthar atá incháilithe mar rannpháirtithe: Caithfidh an obair ar fáil:

source: • Be likely to develop into a lasting job
ga: • Féidearthacht forbartha ina phost inmharthana a bheith i gceist

source: • Not displace existing employment
ga: • Gan fostaíocht reatha a easáitiú

source: • Be a minimum of 20 hours per week
ga: • A bheith 20 uaire ar a laghad in aghaidh na seachtaine

source: • Be for at least 12 months
ga: • A bheith 12 mhí ar a laghad

source: Short-term, seasonal or commissioned/contractual work is not acceptable as employment under the Scheme
ga: Níl obair ghearrthéarmach, shéasúrach nó choimisiúnaithe/ar chonradh inghlactha mar fhostaíocht faoin Scéim

source: Spouse, civil partner or cohabitant swap
ga: Babhtáil chéil, pháirtnéir sibhialta nó chomhchónaitheoir

source: If you qualify for the Back to Work Allowance Scheme but do not wish to avail of the scheme your spouse, civil partner or cohabitant may participate instead
ga: Má cháilíonn tú do Scéim an Liúntais um Fhilleadh ar Obair ach mura dteastaíonn uait leas a bhaint as an scéim is féidir le do chéile, pháirtnéir sibhialta nó chomhchónaitheoir páirt a ghlacadh inti i d’áit

source: You must be getting an increase in your social welfare payment for your spouse, civil partner or cohabitant for a specific amount of time
ga: Caithfidh tú méadú ar an íocaíocht leasa shóisialaigh do do chéile, pháirtnéir sibhialta nó chomhchónaitheoir a fháil ar feadh achar ama ar leith

source: It is usually the same amount of time that you would need to be claiming your payment to qualify for the scheme
ga: Go hiondúil, bíonn an méid céanna ama i gceist agus a mbeadh ort a bheith ag éileamh d’íocaíochta a bheadh i gceist le cáiliú don scéim

source: For example, if you are getting:
ga: Mar shampla, má tá:

source: • Jobseeker's Allowance (JA) a spouse/civil partner or cohabitant must be a qualified adult dependent for 2 years
ga: • Liúntas Cuardaitheora Poist (LCP) á fháil agat ní mór do do chéile, pháirtnéir sibhialta nó chomhchónaitheoir a bheith ina c(h)leithiúnaí aosaithe cáilithe ar feadh dhá bhliain

source: • Illness Benefit a spouse, civil partner or cohabitant must be a qualified adult dependent for 3 years
ga: • Sochar Breoiteachta á fháil agat ní mór do do chéile, pháirtnéir sibhialta nó chomhchónaitheoir a bheith ina ina c(h)leithiúnaí aosaithe cáilithe ar feadh trí bliana

source: • Disability Allowance, Blind Pension, Carer's Allowance (on ceasing caring duties), Farm Assist, Invalidity Pension, Incapacity Supplement or Pre-Retirement Allowance a spouse/civil partner or cohabitant must be a qualified adult dependant for at least 15 months (or 12 months if aged over 50)
ga: • Liúntas Míchumais, Pinsean na nDall, Liúntas Cúramóra (ar scor ó dhualgas cúraim), Cúnamh Feirme, Pinsean Easláinte, Forlíonadh Éagumais, Liúntas Réamhscoir, Pinsean Baintrí/Baintrí Fir (Neamhranníocach), Sochar/Liúntas Banchéile Thréigthe nó Liúntas Banchéile Príosúnaigh á fháil agat ní mór do do chéile, pháirtnéir sibhialta nó chomhchónaitheoir a bheith ina c(h)leithiúnaí aosaithe cáilithe ar feadh 15 mhí (nó 12 mhí má tá siad os cionn 50 bliain d’aois)

source: In the case of Jobseeker’s Allowance, when your spouse, civil partner or cohabitant starts on the scheme a separate claim will be set up in their name
ga: I gcás an Liúntais Cuardaitheora Poist, déanfar éileamh ar leith faoina (h)ainm nuair a thosaíonn do chéile, pháirtnéir sibhialta nó chomhchónaitheoir ar an scéim

source: When your spouse, civil partner or cohabitant starts on the scheme your JA payment will stop
ga: Tiocfaidh deireadh le d’íocaíocht LCP nuair a thosaíonn do chéile, pháirtnéir sibhialta nó chomhchónaitheoir ar an scéim

source: However, your spouse, civil partner or cohabitant can now claim for you as a qualified adult
ga: Mar sin féin, is féidir le do chéile, pháirtnéir sibhialta nó chomhchónaitheoir éileamh ar do shon anois mar dhuine fásta cáilithe

source: You should sign for credits at your local social welfare office
ga: Ba chóir duit síniú do chreidmheasanna ag d’oifig leasa shóisialaigh áitiúil

source: It is important to sign on for credits to protect any future pension entitlements you may have
ga: Tá sé tábhachtach síniú do chreidmheasanna chun teidlíochtaí pinsean ar bith a bheadh agat sa todhchaí a chosaint

source: This new arrangement should not affect the amount of social welfare payment you get as a family
ga: Níor chóir go mbeadh tionchar ag an socrú nua seo ar mhéid na híocaíochta leasa shóisialaigh a fhaigheann sibh mar theaghlach

source: If you (the original owner of the social welfare payment) decide to claim another social welfare payment at any time while your spouse, civil partner or cohabitant is availing of this swap the payment of Back to Work Allowance will stop
ga: Má bheartaíonn tú (bunúinéir na híocaíochta leasa shóisialaigh) ar éileamh a dhéanamh ar íocaíocht leasa shóisialaigh eile ag am ar bith, nuair atá do chéile, pháirtnéir sibhialta nó chomhchónaitheoir ag baint leasa as babhtáil chéile, tiocfaidh deireadh le híocaíocht an Liúntais um Fhilleadh ar Obair

source: If you qualify before 1 May 2009, you will receive support for 3 years (including adult and child dependant allowances) as follows:
ga: Má bhíonn tú incháilithe roimh 1 Bealtaine 2009, gheobhaidh tú tacaíocht ar feadh trí bliana (lena n-áirítear liúntais do chleithiúnaithe fásta agus do leanaí cleithiúnacha) mar seo a leanas:

source: • 75% of your weekly social welfare payment for the first year
ga: • 75% de d'íocaíocht leasa shóisialaigh don chéad bhliain

source: In addition you will keep secondary benefits for 3 years, provided you satisfy a household income means test
ga: Lena chois sin coinneoidh tú sochair thánaisteacha ar feadh 3 bliana, ar an gcoinníoll ar an gcoinníoll go sásaíonn tú tástáil mhaoine ioncaim teaghlaigh

source: • Medical card (household income limit does not apply)
ga: • Íocaíocht Bhreise na Nollag • Cárta Leighis (níl feidhm leis an teorainn ioncaim tí)

source: • Back to School Clothing and Footwear Allowance
ga: • Liúntas Éadaí agus Bróg - Ar ais ar Scoil

source: • Local Authority Differential Rent
ga: • Cíos Difreála Údaráis Áitiúil

source: The Back to Work Allowance is not subject to PRSI or income tax deductions
ga: Níl an Liúntas um Fhilleadh ar Obair faoi réir ag ÁSPC ná ag asbhaintí cáin ioncaim

source: Your Rent Supplement or Mortgage Interest Supplement may be affected
ga: B'fhéidir go mbeadh tionchar ar do Fhordheontais Cíosa/Us Morgáiste

source: Financial assistance is available to employees who qualify for the Back to Work Allowance to further their employment potential, for example, help with interviews, literacy or computer skills
ga: Bíonn cúnamh airgeadais ar fáil d'fhostaithe a bhíonn incháilithe le haghaidh Liúntas um Fhilleadh ar Obair chun cur tuilleadh lena gcumas fostaíochta, mar shampla, cuidiú le hagallaimh, scileanna litearthachta nó ríomhaireachta

source: Family Income Supplement may be payable if you have at least one dependant child under the age of 22
ga: B'fhéidir go mbeadh Forlíonadh Ioncam Teaghlaigh iníoctha má bhíonn ar a laghad leanbh cleithiúnach amháin agat faoi 22 bliain d'aois

source: This weekly tax free supplement is payable if your income is below a certain limit for your family size
ga: Bíonn an forlíonadh saor ó cháin seachtainiúil seo iníoctha má bhíonn d'ioncam faoi theorainn áirithe i gcás méid an teaghlaigh

source: Your Back to Work Allowance and your earnings will be added together when working out your entitlement to Family Income Supplement
ga: Cuirfear do Liúntas um Fhilleadh ar Obair agus do chuid tuilleamh le chéile nuair a bheifear ag oibriú amach do theidlíocht ar Fhorlíonadh Ioncam Teaghlaigh

source: Find out more about Family Income Supplement
ga: Léigh tuilleadh faoi Forlíonadh Ioncam Teaghlaigh

source: Very Long Term Unemployed Programme (VLTU)
ga: Clár do Dhaoine Dífhostaithe go Fadtéarmach (VLTU)

source: The Very Long Term Unemployed Programme is closed from 1 May 2009
ga: Tá an Clár do Dhaoine Dífhostaithe go Fadtéarmach dúnta ó 1 Bealtaine 2009

source: Under this programme, if you had been in receipt of a qualifying payment for 5 years or more, you could continue to receive your payment, plus an additional weekly payment of €44.50 per week for up to six weeks while you were getting training from an employer
ga: Má bhí tú ag fáil íocaíocht incháilithe le 5 bliana nó níos mó, d'fhéad tú leanúint ag fáil d'íocaíochta, chomh maith le híocaíocht sheachtainiúil bhreise de €44.50 in aghaidh na seachtaine suas go dtí 6 seachtaine ina raibh d'fhostóir ag cur oiliúna ar fáil duit

source: After this six week period, you transferred to the Back to Work Allowance if you continued to remain in employment
ga: Tar éis na tréimhse 6 seachtaine sin, d'aistrigh tú do Liúntas um Fhilleadh ar Obair má d'fhan tú ag obair

source: In addition, you also received two payments of €254 when:
ga: Ina theannta sin, fuair tú dhá íocaíocht €254 nuair:

source: • The six week training period is completed
ga: • Atá an tréimhse oiliúna sé seachtaine comhlánaithe agat

source: • You have completed 6 months in employment
ga: • Nuair atá 6 mhí fhostaíochta comhlánaithe agat

source: The Back to Work Allowance Scheme is closed to new applicants from 1 May 2009
ga: Tá an Scéim um Fhilleadh ar Obair dúnta d'iarratasóirí nua ó 1 Bealtaine 2009. Tuilleadh eolais
